<a href="https://colab.research.google.com/github/palpitation0/Machine-Learning-homework/blob/master/12%EA%B0%95_%EA%B3%BC%EC%A0%9C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from sklearn import tree
import pandas as pd
import numpy as np

In [0]:
titanic = pd.read_csv('https://raw.githubusercontent.com/guru99-edu/R-Programming/master/titanic_data.csv')

In [3]:
titanic.head(3)

   x  pclass  survived  ...    cabin embarked                        home.dest
0  1       1         1  ...       B5        S                     St Louis, MO
1  2       1         1  ...  C22 C26        S  Montreal, PQ / Chesterville, ON
2  3       1         0  ...  C22 C26        S  Montreal, PQ / Chesterville, ON

[3 rows x 13 columns]

In [0]:
titanic = titanic.drop(['x','name','ticket','cabin','home.dest'], axis=1)

In [5]:
titanic.head(3)

   pclass  survived     sex     age  sibsp  parch      fare embarked
0       1         1  female      29      0      0  211.3375        S
1       1         1    male  0.9167      1      2    151.55        S
2       1         0  female       2      1      2    151.55        S

In [0]:
titanic.pclass = titanic.pclass.replace({1:"Upper", 2:"Middle", 3:"Lower"})

In [0]:
titanic.survived = titanic.survived.replace({0:"No", 1:"Yes"})

In [8]:
titanic.head(3)

  pclass survived     sex     age  sibsp  parch      fare embarked
0  Upper      Yes  female      29      0      0  211.3375        S
1  Upper      Yes    male  0.9167      1      2    151.55        S
2  Upper       No  female       2      1      2    151.55        S

In [9]:
titanic.isnull().sum()

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    0
dtype: int64

In [10]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 8 columns):
pclass      1309 non-null object
survived    1309 non-null object
sex         1309 non-null object
age         1309 non-null object
sibsp       1309 non-null int64
parch       1309 non-null int64
fare        1309 non-null object
embarked    1309 non-null object
dtypes: int64(2), object(6)
memory usage: 81.9+ KB

In [0]:
titanic['pclass'] = titanic['pclass'].astype('category')
titanic['survived'] = titanic['survived'].astype('category')

In [12]:
titanic.pclass.dtypes

CategoricalDtype(categories=['Lower', 'Middle', 'Upper'], ordered=False)

In [0]:
X = titanic.drop(["survived"], axis=1)
y = titanic["survived"]
X_one_hot = pd.get_dummies(X, drop_first=True)

In [0]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X_one_hot, y, test_size=0.25, random_state=0)

In [0]:
from sklearn.svm import SVC
import matplotlib.pyplot as plt

In [20]:
from sklearn.ensemble import RandomForestClassifier
forest = RandomForestClassifier(n_estimators=100, oob_score=True)
forest.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=True, random_state=None,
                       verbose=0, warm_start=False)

In [21]:
predicted_y = forest.predict(X_test)
print("#Errors : %i" %np.sum(y_test != predicted_y))

#Errors : 69

In [22]:
from sklearn.metrics import accuracy_score
accuracy = accuracy_score(y_test, predicted_y)
print(f'Out-of-bag score estimate : {forest.oob_score_:.3}')

Out-of-bag score estimate : 0.788

In [23]:
print(f'Mean accuracy score : {accuracy:.3}')

Mean accuracy score : 0.79